OCR(t)
{
	t:=RegExReplace(t,"(\.|,|:|;)\K(,|:|;)") ; парные знаки
	t:=RegExReplace(t," {1,3}(?=(\.|,|:|;|!|\?|\)|]|}))") ; пробелы до знаков препинания
	t:=RegExReplace(t,"(\[|\{|\()\K\s{1,3}") ; пробелы после скобок
	t:=RegExReplace(t,"\.\K (?=\.)") ; пробелы меж точек
	t:=RegExReplace(t,"\.(?!(\d|\.| |""))",". ") ; пробелы после точек
	t:=RegExReplace(t,",\.?(?!(\d| |""))",", ") ; пробелы после запятых
	t:=RegExReplace(t,"m) {1,}$") ; пробелы в конце строк
	t:=RegExReplace(t,"\S\K {2,3}(?=\S)"," ") ; лишние пробелы
	t:=RegExReplace(t,"(:|;|!|\?)(?!(\d| |!|\?|""))","$1 ") ; пробелы после знаков
	t:=RegExReplace(t,"''","""")	; кавычки двойным апострофом
	return t
}